var n = [ "蛋糕|戚风|芝士|杯子蛋糕|古早蛋糕|千层蛋糕|蛋糕卷|磅蛋糕|海绵蛋糕|蒸蛋糕|肉松小贝|玛德琳|天使蛋糕|生日蛋糕|慕斯|裱花蛋糕|盒子蛋糕|提拉米苏|淋面蛋糕|翻糖蛋糕|转印蛋糕|欧式蛋糕|乳酪蛋糕|舒芙蕾|布朗尼", "面包|吐司|造型面包|餐包|排包|披萨|菠萝包|毛毛虫|手撕包|可颂|欧包|甜甜圈|全麦面包|花环包|汉堡|法棍|奶酪包|贝果|三明治|脏脏包|软欧", "饼干|曲奇|夹心饼|蔓越莓饼干|酥饼|苏打饼|玛格丽特|整形饼干|小饼|能量球|手指饼干|磨牙棒|阿拉棒", "甜品|雪媚娘|溶豆|布丁|马卡龙|泡芙|巧克力|豆乳盒子|草莓大福|牛轧糖|奶糖|花生糖|冰淇淋|班戟|马芬|木糠杯|棒棒糖|果冻", "点心|蛋挞|蛋黄酥|牛轧糖|雪花酥|太妃糖|蛋卷|凤梨酥|苹果派|菠萝派|蛋黄派|南瓜派|苹果塔|挞|酥|司康|铜锣烧|芝麻糖|老婆饼|棉花糖|驴打滚|榴莲酥|发糕", "饼|月饼|冰皮月饼|桃山皮月饼|广式月饼|苏式月饼" ], t = [ "饮品|咖啡|豆浆|奶茶|酒|鸡尾酒|果汁|茶|花茶|糖水|酸梅汤", "冷饮|冰淇淋|冰激凌|雪糕|星冰乐" ], r = [ "家常菜|煎|蒸|炖|红烧|炸|卤|干锅|火锅|免烤|辣|咖喱|糖醋|蒜香|酸甜|孜然|鱼香|五香|清淡|微波炉|平底锅|塔吉锅|汤|鱼|萝卜|土豆|茄子|黄瓜|香菇|白菜|红烧肉|排骨", "异国风味|日式|韩式|西式|西餐|东南亚", "主食|炒饭|焖|饭团|盖浇饭|煲仔饭|焗饭|烩饭|粥|饺子|馒头|馄饨|包子|三明治", "面条|拌面|炒面|汤面|凉面|焖面", "水产|海水鱼|淡水鱼|三文鱼|鲫鱼|金枪鱼|黄鱼|带鱼|鳕鱼|虾|虾仁|海米|虾皮|明虾|基围虾|龙虾|小龙虾|河虾|蛤蜊|干贝|鲍鱼|螃蟹|梭子蟹|大闸蟹|蟹肉", "蛋类|鸡蛋|咸蛋|皮蛋|鹌鹑蛋|鸭蛋|咸鸭蛋", "奶制品|牛奶|黄油|巧克力|奶油|奶酪|酸奶|黑巧克力|淡奶油|奶油奶酪|炼乳|奶粉|马苏里拉奶酪|白巧克力|酸奶油|酥油|芝士", "豆制品|豆腐|香干|豆渣|千张|腐竹|素鸡|油豆皮|豆干|豆腐皮", "腌咸制品|火腿|香肠|培根|火腿肠|腊肉|酸菜", "汤羹|排骨汤|豆腐羹|疙瘩汤|酸辣汤|汤", "早餐", "粽子" ];

function c(n, t, r) {
    var c = [];
    return t.forEach(function(t) {
        var r = t.split("|"), e = r.filter(function(t) {
            return n.indexOf(t) > -1;
        });
        e.length && e.unshift(r[0]), c = c.concat(e);
    }), c.length && r && c.push(r), c;
}

module.exports = function(e) {
    var u = [];
    return (u = (u = (u = u.concat(c(e, n, "烘焙"))).concat(c(e, t))).concat(c(e, r))).filter(function(n, t) {
        return u.indexOf(n) === t;
    });
};